
//// 1 ########################
console.clear()
console.log('1 задание')
console.log('_____________________________________')
var A = prompt('Введите число A: ')
var B = prompt('Введите число B: ')
console.log('A= ' + A)
console.log('B= ' + B)

if (A > B) {
    alert(A);
    console.log('Наибольшее число= ' + A)
}
else {
    alert(B);
    console.log('Наибольшее число= ' + B)
}

console.log('_____________________________________')
//2 #############
console.log('2 задание')
console.log('_____________________________________')
var X = prompt('Введите число X: ')
var Y = prompt('Введите число Y: ')
console.log('X= ' + X)
console.log('Y= ' + Y)

if (X > Y) {
    alert(Y);
    alert(X);
    console.log('Возрастающая последовательность= ' + Y + X)
}
else {
    alert(X);
    alert(Y);
    console.log('Возрастающая последовательность= ' + X + Y)
}
console.log('_____________________________________')
////3  #########################################
console.log('3 задание')
console.log('_____________________________________')
var a = 4, b = 3, c = 5;
var S = 0, p = 0;
p = (a + b + c) / 2
S = p * (p - a) * (p - b) * (p - c)
console.log('Стораны треугольника ' + a + '  ' + b + '  ' + c + '  ')

console.log('the result is: ' + Math.sqrt(S))

console.log('_____________________________________')
//4  ###########################
console.log('4 задание')
console.log('_____________________________________')
var x = 4, y;
y = 4 * x++ //4*4=16 затем инкрементировать x

console.log('Значение y= ' + y)
console.log('Значение x= ' + x)//В обоих случаях x=5
console.log('___Второй случай, когда инкремент перед x___')
x = 4;//Возвращаю исходное значение переменной
y = 4 * ++x
//Наоборот инкремент выполняется первым действием, а затем умножение (4*5)
console.log('Значение y= ' + y)
console.log('Значение x= ' + x)//В обоих случаях x=5
console.log('_____________________________________')
//5 ########################
console.log('5 задание')
console.log('_____________________________________')
var a = 2
a *= 2 + 5  //a=a*(2+7)
console.log(a)//14
var a = 3, c = 2 + ++a  //a=4; c=2+4;
a = a + c   //a=4+6
console.log(a)//10
var a = 3, c = 2 + a++  //a=3; c=2+3; a=4;
a = a + c //a=a+5
console.log(a)//9

console.log('_____________________________________')